{
  "languages": {
    "en": "English",
    "ja": "Japanese (日本語)"
  },
  "licenses": {
    "caption": "List of licenses for libraries used in Valheim IconPack Editor",
    "library": {
      "name": "Library",
      "version": "Version",
      "publisher": "Publisher",
      "license": "License text"
    }
  },
  "forms": {
    "common": {
      "required-mark": "*",
      "error": {
        "required": "This field is required.",
        "invalid-text-format": "Invalid format.",
        "unsupported-file-format": "File format not supported."
      }
    },
    "image-file": {
      "select-area": {
        "dnd-files-here-or": "Drag and drop files here, or",
        "browse": "browse"
      },
      "image-data": {
        "sub-directory": "Sub directory",
        "filename": "File name",
        "width": "Width",
        "height": "Height"
      }
    }
  },
  "start-page": {
    "overview": "## What is Valheim IconPack Editor?\n----\nValheim IconPack Editor is a tool for creating and editing [Icon Packs](https://github.com/eideehi/valheim-automatics/blob/main/docs/custom-icon-pack.adoc) used in the Valheim mod \"[Automatics](https://github.com/eideehi/valheim-automatics)\" to customize the icons displayed on the map.\n### Notes:\n* Currently, it does not support responsive layout. It is recommended to use it on displays with a resolution of 1366x768 or higher.\n* Currently, the only available format for outputting icon packs is for Nexus Mods. The ability to output icon packs for Thunderstore is under development.",
    "create-iconpack": {
      "caption": "Do you want to create a new icon pack?",
      "iconpack-name": {
        "label": "Icon Pack name",
        "help": "# Icon Pack name\n----\nEnter the name of your icon pack. You can use uppercase and lowercase letters, numbers, underscores, dots, plus signs, hyphens, and spaces. Note that leading and trailing spaces will be removed."
      },
      "create-iconpack": "Create new Icon Pack"
    },
    "load-iconpack": {
      "description": "Would you like to load an existing icon pack?",
      "load-iconpack": "Load Icon Pack",
      "failed-to-load-iconpack": "Failed to load the icon pack.",
      "drop-to-load-iconpack": "When drop a file in the screen, it loads the icon pack."
    }
  },
  "iconpack-editor": {
    "target": {
      "label": "Target",
      "help": "# Target\n----\nSpecify either the display name or the internal name. The display name is the string that appears on the game screen, such as `Boar`, whereas the internal name is the string used in the game's program, such as `$enemy_boar`. You can obtain the internal name by using the `printnames` [command provided by Automatics](https://github.com/eideehi/valheim-automatics#console-commands). For further details on the differences in matching between display names and internal names, please refer to the [Automatics documentation](https://github.com/eideehi/valheim-automatics#matching-by-display-name-and-internal-name)."
    },
    "level": {
      "label": "Level",
      "help": "# Level\n----\nThis is used only for animals and monsters. It does not need to be set for other items or locations. By setting this option, it is possible to assign different icons for animals and monsters according to their level. Note that the state without a star is level 1. One star is level 2, and two stars are level 3.",
      "placeholder": "If omitted, it will match all levels"
    },
    "icon": {
      "label": "Icon",
      "help": "# Icon\n----\nSet the file for the icon to be used for the map pin. Since icons that are too large will be a hindrance, it is recommended to keep them at a maximum of around 64x64."
    },
    "hide-name-tag": {
      "label": "Hide name tag",
      "help": "# Hide name tag\n----\nHide the name of the pin displayed on the map. This option may be useful if the details of the target can be understood only by the icon image and the name tag is not necessary."
    },
    "icon-scale-large-map": {
      "label": "Icon scale for large map",
      "help": "# Icon scale for large map\n----\nSet the scale of the icons displayed on the zoomed-in map. On the zoomed-in map, icons are resized to 32x32, but by multiplying this display magnification, you can adjust the size of the icons. If the size of the icon is 64x64, setting the display magnification to 2 will make the icon appear as 64x64 even on the zoomed-in map."
    },
    "icon-scale-small-map": {
      "label": "Icon scale for small map",
      "help": "# Icon scale for small map\n----\nSet the scale of the icons displayed on the mini-map. On the mini-map, icons are resized to 16x16, but by multiplying this display magnification, you can adjust the size of the icons. If the size of the icon is 64x64, setting the display magnification to 4 will make the icon appear as 64x64 even on the mini-map."
    },
    "add-entry": "Add this content",
    "overwrite-entry": "Overwrite the edits",
    "delete-entry": "Delete this entry"
  },
  "json-view": {
    "entry": {
      "level": "Lv.{{level}}"
    }
  }
}
